'90
'em
'taters
0
00
000
00ecgillespie
01
011
013
014
021
037
038
050
051
053
055
059
065
072
094
097
0l2
1
10
100
101
1010
102
104
105
106
107
108
109
10th
11
110
1111
114
115
118
11th
12
120
12000
121
12180
122
123
1234
124
125
127
129
13
130
131
132
133
135
137
138
139
14
140
141
142
144
145
147
148
149
15
150
152
153
154
155
156
157
159
15th
16
160
161
163
165
167
168
169
16th
17
170
171
172
173
174
176
177
178
179
17th
18
181
182
184
185
186
186i5325
187
189
19
190
192
194
1940
1950
1956
196
1964
197
1972
1978
198
1980
1981
1982
1984
1985
1986
1987
1988
1989
199
1990
1991
1992
1993
1994
1995
1b
1o
1st
2
20
200
2000
2003
201
2011shoreline
203
204
205
206
208
209
20s
21
213
217
2177
22
225
228
23
230
231
24
240
246
247
249
25
253
256
26
260
268
269
27
275
279
28
280
285
287
28th
29
291
2b
2m
2nd
2o
3
30
300
309
30s
31
313
320
321
324
328
329
33
330
332
337
338
34
341
344
346
35
372
374
379
38
381
3825
384
386
394
395
3o
3pts
3rd
4
40
401
41
410
4118
4125
414
416
418
422
429
434
438
4425
452
4525
453
461
46556
468
469
47
472
4725
475
479
4825
486
488
48th
4925
4o
4th
5
50
500
502
503
51
5125
516
520
5225
527
53
531
532
5325
534
54
5425
544
545
5525
555
559
560
5625
563
57
571
5725
573
578
58
582
5825
585
586
587
59
5924
5925
596
5th
6
60
602
6025
606
61
611
6125
613
614
616
62
621
6225
624
627
629
63101
632
6325
635
637
638
6425
643
645
649
65
651
6525
655
657
66
660
6625
670
671
6725
675
68
6825
685
687
689
69
692
6925
694
696
6th
6utica
7
7000
701
7025
7044
705
706
708
70s
710
711
7124
7125
713
716
72
7225
727
73
730
7325
738
739
7425
745
746
749
75
751
752
7525
755
76
768
77
7725
779
78
784
796
7th
8
80
80's
800
807
80s
81
83
830
831
833
839
842
848
849
85
852
856
861
87
878
88
888
89
890
8900
8th
9
90
902
90s
91
911
92
926
93
933
94
94039
942
946
947
955
956
962
965
967
97
970
981
982
986
99
990
993
994
9th
a
a's
aa
aaa
aargh
aaron
ab
abandond
abbott
abbotts
abc
abilities
ability
able
aboard
abortion
abott
abotu
about
above
absolutely
absurd
absurdity
abundance
abury
ac
acceptance
access
according
accordion
account
accumulated
accurate
accusation
accusations
accuse
accused
ace
acknowledge
acquisition
across
act
action
activatedmike
activating
active
activities
acts
actual
actually
adams
add
added
adders
adding
addition
additional
address
adequate
adirondack
adjust
adjusting
administration
admiral
admired
admission
admit
admitted
adopt
adults
advance
advanced
advances
advantage
adverse
advice
afc
affect
affected
affiliation
afford
aforemen
afraid
after
afternoon
agai
again
against
age
ageless
aging
ago
agree
agreement
ah
ahead
ahhh
ahl
ahlund
aims
ain't
air
airwaves
aking
al
alabama
alan
alarmers
albeit
alberta
albrown
alf's
alfredo
all
allegation
allen
alley
allez
allow
allowed
allowing
allows
almost
alomar
alomar's
alone
along
alot
already
also
alternate
although
altogether
always
am
amato
amaze
amazed
amazing
amc
amendments
america
american
americans
amicus
amish
among
amongst
amonte
amontenew
amount
ample
amusement
an
anahaim
anaheim
analysis
analyze
anchor
and
anderson
andersson
andreas
andres
andrew
andreychuck
andreychuk
andy
anecdotal
anecdotes
anf
angeles
angeles3boston3
angels
angle
announce
announced
annoying
anointed
anomolies
anonymnity
anot
another
anson
answer
answering
anthem
anti
antics
any
anybody
anymore
anyone
anything
anyway
anyways
anywhere
apparent
apparently
appeal
appeals
appear
appearance
appearances
appeared
applied
applies
apply
applying
appointed
appreciate
appreciated
apprecitated
april
aprils
aptitudes
aqlso
aquino
arbour
archived
arctic
are
area
aren't
arena
arena's
argonauts
argued
argues
argument
argumentative
arguments
ari
arm
arms
armstrong
around
arrangement
arrival
arsenal
art
arthur
article
articles
artifical
artist
artistry
as
ashton
aside
ask
asked
asking
asks
asleep
aspect
aspects
aspersions
ass
assenmacher
assesment
assessment
asset
asshole
assholes
assist
assistant
assists
association
assume
assumed
assuming
assumptions
assuredly
astacio
astros
at
ate
athlete
athletes
athleticism
athletics
atlanta
atlanta1texas7
ats
attack
attempt
attempted
attempting
attendance
attends
attention
attitude
atttributed
aura
aurggghhhhhhhhh
austin
austria
author
author's
automatic
automatically
autowrap
availability
available
average
averages
avery
avg
avoid
avoided
await
award
awarded
aware
away
awesome
awful
awkward
b's
b9
ba
babies
back
backed
background
backstrom
bad
badmouth
baerga
baerga's
bag
bagging
bait
baker
balanced
balk
balked
ball
ballard
ballgame
ballgames
ballpark
ballplayers
balls
balmer
baltimore
bammer
band
bandwagon
bang
banned
banzai
bar
barasso
barberie
bare
barehanded
barely
barfly
barrasso
barrier
barry
barry's
base
baseball
based
baseman
baseman's
basemen
baserunners
bases
basic
basically
basis
basketball
bassen
bat
bats
batted
batter
batter's
batters
batting
battle
battling
baun
bay
baylor
bayor
bc
be
beach
beam
bearcats
bears
beastmaster
beat
beaten
beating
beats
beaupre
beav
beaver
became
because
become
becomes
becoming
becomming
bed
beef
been
beer
beezer
before
beg
began
begin
beginning
begins
begun
behind
behindr
behunin
being
beleive
belfour
beliefs
believe
believed
believers
believes
bell
bellows
bellyaching
belong
belongs
below
belt
benched
benches
benito
benning
beranek
berg
bergman
bergqvist
berman
berry
bertaggia
berube
besides
best
bet
bets
better
bettman
between
beukeboom
beyond
bh's
bi
bias
biased
biases
big
bigots
bill
billy
biloxi
binghampton
binghamton
bird
bit
bitter
bjoern
bjoernar
bjorkloven
black
blackhawks
blades
blam
blame
blamed
blaming
blanket
blanketing
blatantly
blauser
bleachers
bleah
blessed
blew
blish
block
blomberg
blooded
bloodhook
bloodletters
bloom
bloop
blow
blowing
blown
blows
blowtisserie
blue
blueline
blues
blunder
bluntly
blunts
blur
blurb
blvd
bo
board
boarding
boards
bob
bobby
bobonds
body
boggs
bogus
bombers
bond's
bonds
boneheadedly
bonilla
book
books
boops
booted
borchevsky
borchevsy
border
borderline
bored
boredom
borg
boring
born
borque
borshevshky
bos
bosio's
boskie
boss
bosse
bossy
boston
botched
both
bother
bottle
bottom
bottomline
boulder
bounces
bouncing
bound
bourque
bowles
bowman
box
boy
boys
brain
brains
brainwashing
brand
brave
braves
break
breakaway
breakaways
breakdown
breaking
breaks
bream
brendan
brent
breton
brett
brettwilliams
brewers
brian
brians
brief
brien
bright
brilliant
bring
bringing
brings
british
brittenson
broadcast
broadcaster
broadcasters
broadcasts
broke
broken
broker's
bronx
broten
brother
brothers
brought
brown
brown0
browning
browse
bruce
bruce's
bruins
bruises
brunet
bruno
bryan
bryant
bsing
btw
buchberger
buck
buck's
bucks
bucky
bud
buechelle
buf
buffalo
build
building
builds
bullpen
bullpen'll
bum
bunch
burbank
burden
bure
bure's
bures
burger
burke
burn
burning
burns
burnsian
burr
business
buster
busy
but
butch
butcher
butler
butt
buttkisser
butts
buy
by
bye
byw
c'mon
ca
cable
cage
cakewalk
cal
calculate
calder
calgary
california
call
called
caller
calling
calls
calm
came
camera
campbell
campi
campuses
can
can't
canada
canada'
canadian
canadians
canadiens
candidate
candidates
cannot
canseco
canseco's
canuck
canucks
cap
capabilities
capable
capacity
cape
capitals
caps
captain
capture
car
carbonneau
card
cardinal
cardinals
cards
care
career
careers
careless
cares
carew
caring
carl
carley
carlos
carmel
carpenter
carried
carry
carrying
carson
carter
carter's
case
cases
casey
cashman
castillo
cataldi
catch
catcher
catchers
catches
catching
category
caught
cause
caused
causing
cavanagh
cbc
cd
cdept
cdi
cecil
cedeno
celebrities
celio
censorship
center
centerfield
centre
centres
certain
certainly
cesar
cfl
chain
chaisson's
chal
challenge
challenging
champions
championship
champs
chance
chances
change
changed
changes
changing
channel
channels
chapman
chaps
character
charge
charged
charges
charles
charleshoman
charlie
cheap
check
checked
checking
checks
cheers
cheevers
cheketts
chelios
chelios's
chelioses
chemical
cherry
cheveldae
chevy
chi
chiasson
chicago
chicago0baltimore4
children
chip
chipdale
chipmunks
chipper
chips
choice
choke
choked
choking
choose
chooses
chop
chopped
chopper
chose
chris
christ
christian
chuck
chung
church
cicarelli
ciccarelli
cinci
cincinnati
cincinnati2cleveland1
cincy
circles
circuit
circumstances
cirella
ciretrehguad
citation
cities
city
city1
civic
claim
claimed
claiming
clark
clarke
class
classes
classic
classicalhard
classy
clayton's
clean
cleanup
clear
cleared
clearing
clearly
clemens
cleveland
clinch
clint
clinton
clintony
clobbered
clock
clone
close
closely
closer
closest
closeup
closing
clothes
club
clubhouse
clubs
cluster
clutch
clyde
co
coach
coached
coaches
coaching
coast
cobra
cocky
coffey
cohen
cold
coleman
coles
colgate
colin
collar
collected
collections
collective
collectively
college
collesium
collier
colonists
colons
color
colorado
colorado0california
colorful
colorized
columbus
column
columnists
columns
combined
come
comeback
comeon
comeone
comes
comfortably
coming
comment
commentators
comments
commercials
commie
commissioner
commitments
commonly
communtiy
company
compare
compared
comparing
comparision
comparison
compete
competition
competitive
complain
complained
complaining
complains
complete
completely
complications
components
comprise
computer
computers
concealed
concede
conceivable
conceive
concentration
concern
concerned
concerning
concessions
conclude
conclusive
conclusively
concoct
condition
conditions
condone
conducive
conference
confidence
confronting
confuse
confused
congenially
congratulate
conine
conn
connor
connor's
connotations
consecutive
consequence
consider
considerable
considerably
consideration
considered
considering
consistant
consistency
consistent
consistently
conspiracy
constant
constructive
consume
contend
contender
contenders
contest
contested
context
continent
continue
continued
continues
continuing
continuning
contractual
contradicting
contrary
contribute
contributed
contributes
contributing
contribution
contributions
contributors
control
controling
controversy
convenient
conversation
convert
convincing
cook
cool
cooperstein
copious
coplay
copps
copy
cordially
coredancenew
corefused
corner
correct
corrected
correctly
correlate
correlation
corresponding
corson
cory
cost
costas
cote
cote's
cotto
could
could've
couldn't
counsel
count
counted
counter
countries
country
counts
county
coupe
couple
course
courses
court
courtesy
courtnall
courts
cover
coverage
covered
covers
coveted
cow
cowboys
cox
cracking
craig
crak
crap
craven
crawl
crawled
crazy
create
created
creation
credit
credited
creosote
crew
criminally
crisp
critic
criticizes
criticizing
crop
cross
crossed
crossman
crowd
crucial
cruising
cruyenaere
crying
cub
cuba
cubs
cuck
cullen
cultural
cup
cups
curious
curiousity
current
currently
cursive
curtis
cut
cutting
cy
cynically
cyt
czech
da
dad
daigle
dale
dallas
dame
dammit
damn
damnation
damp
damphousse
dan
danielle
danny
dark
darling
darnell
darrell
darren
darrin
darryl
darse
dart
daryl
data
date
dave
daves
david
davie
davis
dawdle
dawdling
dawson
day
days
de
dead
deadline
deal
dealing
dean
dean's
dear
death
debatable
debate
debbie
decade
decent
decide
decided
decimation
decision
declined
deep
defect
defence
defender
defending
defenition
defense
defenseman
defensemen
defensive
defensively
deficits
define
defining
definitely
definition
definitions
deflect
deflected
deflections
degrade
degrees
dehradun
deion
del
delaware
delay
delayed
delete
deleted
delino
deluca
deluxe
demand
demers
demonstrates
denied
denies
denis
dennis
deny
department
depend
dependency
depending
depends
deportation
deprived
depth
derek
derogatory
descent
descriptions
deserve
deserved
deserves
deserving
deshields
design
designated
designed
despite
destined
destiny
destrade
destroyers
det
detailed
details
determined
determines
detractors
detriot
detroit
detroit's
detroits
devellano
devellano's
develop
developed
developes
developing
devils
devote
dexterity
dg
dh
dh's
dhs
dialed
dibble
dick
dickhead
did
didn't
didnt
die
diego
diet
differ
difference
differences
different
differently
difficult
difficulties
diligent
diminish
dine
dineen
ding
dinger
dino
dion
dionne
dionne's
diques
direction
director
dirt
disadvantages
disagree
disappear
disappointed
disappointment
disaster
disc
discernible
discomfort
discount
discrimination
discussed
discussing
discussion
disliked
dismantle
dismiss
dismissing
disney
displayed
displaying
dispute
disputed
disregard
disrupted
dissappointed
distance
distressed
distributed
district
disturbance
ditto
div
divided
division
divisional
divisions
dl
do
doctors
dodger
dodgers
does
doesn't
dog
dog's
doggie
doghouse
dogs
doing
dolven
dome
domestic
domi
dominated
domingo
don
don's
don't
donaldson
done
dont
doodah
doomsville
door
dortmund
double
doubling
doubt
doug
douris
down
downright
downtown
dozen
dp
dps
dr
draft
drafted
drafting
drag
drake
drastic
dravecky
draw
drawing
draws
dreadful
dream
dreaming
dreams
dressing
drew
driver
driving
drop
dropped
drought
drugs
drunken
druryharvard
dryden
du
ducks
due
duel
duff
duggan
dugout
duh
duluth
dumb
dumbest
dunno
dunnow
duplicate
duquesne
during
dvb
dve
dweeb
dykstra
dynasties
dynasty
each
eagle
earlier
early
earth
easily
east
eastman
easy
eberle
econ
ed
eddie
edge
edit
edition
edm
edmonton
education
educational
edward
effect
effective
effort
effortless
ego
eh
eight
eighth
einstien's
either
ejected
eldoret
elementary
elephants
eli
elias
eligible
eliminate
eliminated
eliminiate
elite
ellet
ellis
else
elsewhere
elvis
em
email
emergence
empty
enable
end
ended
ends
energy
enforce
enforced
enforcing
engineering
england
english
enjoy
enjoying
enough
enraged
entered
enters
entertaining
entire
entitled
environmental
epstein
equal
equalized
equally
equipe
equipement
era
eradicators
eric
ericsson
erni
error
errors
escalating
especially
espn
espn's
espn2
espy
essa
essensa
establish
established
estimate
et
etc
eternal
ethical
euro
europe
european
europeans
euros
eurosport
evaluate
evaluation
evan
evans
evason
even
evening
evenings
event
events
eventually
ever
every
everybody
everyone
everything
everywhere
evidence
evident
evolution
ex
exact
exactly
example
examples
excalibur
excell
excellent
except
exception
exceptionally
excited
excitement
excuse
executive
exercise
exercising
exist
existance
existence
existent
expand
expanding
expect
expectation
expectations
expected
expectin
expecting
expediency
expenses
expensive
experience
experienced
expert
expertise
expire
explain
explained
explanation
explanations
exploded
explosive
expos
exposed
expressed
extend
extended
extent
extra
extremely
eye
fa
face
faceoff
faceplants
facing
fact
factor
factors
faculties
faggot
failing
fails
failure
fair
fairly
faith
fall
fallacious
fallacy
fallen
falls
fame
famers
families
familty
family
famous
fan
fan's
fans
faq
far
fare
farr
farr's
fascinates
fascinating
fashionable
fast
fat
fate
fatso
fault
faults
favor
favorite
favorites
favourites
fax
fear
featuring
federal
federov's
fedorov
feed
feedback
feeding
feel
feeling
feet
feisty
felix
fell
felonies
felt
female
ferierra
ferierra's
fermentation
fernandez
ferriera
few
fewer
fiasco
fickle
field
fielded
fielder
fielders
fielding
fields
fifteen
fifth
fight
fighting
fights
figure
figured
filed
files
filinuk
fill
fillies
filling
filly
final
finally
finals
find
finding
finds
fine
finesse
fingernail
finish
finished
finland
finnish
finns
fire
fired
firepower
firm
first
firstbaseman
fish
fisher
fist
fists
fit
fits
five
fix
fixed
flame
flames
flamming
flashed
flattery
fleury
flexible
flight
flipped
floodgates
florida
florida6kansas
flow
fluke
fly
flyers
flying
foligno
folks
follow
followed
following
food
foolish
football
for
forbes
force
forced
forcefully
forces
forcing
foresaw
forever
forget
forgotten
form
format
former
formula
formulating
forseeable
forth
forum
forward
forwards
fought
foul
found
foundation
four
fourth
foxx
fr
frack
fracus
france
francesa
franchise
francis
francis's
francisco
franciscoidletoronto
franco
franjione
frank
frank's
fraser
frasses
fred
freddy
fredericks
fredericton
free
freedom
fregosi
french
fresh
friday
friend
friends
frobinson
froemming
from
front
froot
frustrated
frustration
fryman
ftr
fuck
fugazi
fuhr
full
fun
function
funded
funds
funny
furriners
further
furthermore
fuss
futility
future
fuzzfaces
gaa
gaetano
gaetti
gaetti's
gaffes
gag
gagit
gail
gainey
gainey's
gaj
gallaraga
gallego
galley
galore
gambler's
gambling
game
games
gammons
gant
gant's
garcia
garden
garry
garryola
gartner
garvey
gary
garydare
gather
gaudreau
gaudreausan
gave
gax
gb
geddy
gee
geez
gehrig
genenius
general
generally
generated
generating
generation
geniuses
geoff
george
gerald
germany
gerry
get
gets
gettin
getting
giants
gil
gilbert
gilles
gilmour
gilmour's
gingerly
girl
girls
give
given
gives
giving
glad
gladiators
gladly
glance
glare
glavine
gld
glenn
glimpse
glory
glove
gloved
gm
go
goal
goaldingers
goalie
goalie's
goalies
goals
goaltending
goddess
gods
goes
going
golden
golf
golfing
gonads
gone
goneso
gonna
gonzalez
goobmeister
good
goods
goons
goose
gord
goring
got
gotta
gotten
government
grab
grace
graced
graffiti
graham
grand
grandmother
grandstanding
grant
granted
graphics
grasp
grating
graves
gray
great
greater
greatest
greatly
green
greenberg
greenleaf
greeted
greg
gregg
gregmeister
gretzky
gretzky's
greybeards
griffey
griffin
grizzly
groin
gross
groundballs
grounder
groundouts
group
groupstandings
growing
grubbing
guaranteed
guess
guessing
guests
guide
gumby
gun
gund
gund's
gunds
gunning
gurus
guy
guy's
guys
guzman
gymnastics
ha
haas
hab
habits
habs
hacked
hacking
had
hadn't
hagerman
hahahahahaa
hairs
hakan
hal
half
halfway
hall
hall's
haller
hamilton
hammer
hammond
hand
handbook
hander
handing
handled
handles
hands
hanging
hank
happen
happened
happening
happens
happy
har
hard
harder
hardly
harila
harkey
harry
harsh
hart
hartford
harvey
has
hasn't
hat
hatcher
hate
hating
haunt
haunting
have
havelock
haven
haven't
having
hawaiian
hawgood
hawk
hawks
hayes
hayward
he
he'd
he'll
he's
head
header
headlines
heads
health
healthy
healy
heap
hear
heard
hearing
heart
hearts
heather
heck
heckling
hedgehogs
height
heikki
held
hell
hello
helmet
help
helping
helpless
helps
helsinki
hence
henderson
henke
henneman
henri
henry
her
here
here's
hereabouts
heritage
herm
hero
hersheiser
hesitate
hextall
hey
hi
hibbard
hiebert
higest
high
higher
highest
highlanders
highlight
highly
hilarious
hill
hillside
him
himself
hindsight's
hire
hiring
hirschbeck
hirschbeck's
his
history
hit
hitchcock
hite's
hits
hitter
hitter's
hitters
hitting
hmm
hmmm
ho
hockey
hof
hoffa
hog's
hojo
hold
holder
holders
holding
hole
holes
hollenstein
holsteins
holy
home
homeboy
homer
homered
homers
homeruns
homesick
homosexual
homosexuals
honestly
honey
honors
honour
honoured
hope
hopefully
hopeless
hoping
horrible
horror
hosers
host
hosts
hot
houdini's
hour
hours
house
houston
houston1oakland9
how
howald
howard
howe
howe's
however
howie
hr
huge
hughes
huh
hull
hum
humiliating
humor
hunch
hung
hunger
hunter
hurl
hurlbut
hurricane
hurry
hurst
hurt
hurts
husband
hustle
hype
hypothesis
hypothetical
i
i'd
i'll
i'm
i've
ibeing
ibl
ice
icemachine
idea
ideal
ideally
identified
idiot
idle
idlemilwaukee
idleminnesota
idleseattle
idouble
ie
if
ifl
iggles
iglesias
ignatowski
ignorance
ignore
ignored
ignores
ignoring
ihensley
ihl
ii
iii
illusions
illustrated
im
imaginary
imagine
imho
imitation
imlach's
immaturity
immediate
immediately
immigrants
immortal
imnsho
imo
impact
impaler
imperfectly
implicitly
imply
impo
importance
important
impressed
impresses
impression
impressive
improve
improved
improvement
improving
imus
in
ina
inability
inc
incapable
incarnation
inception
inches
incident
include
included
includedo
includes
including
incorrect
increase
incredible
incredibly
indeed
indiana
indians
indicates
indicating
indication
indicator
indifference
indirectly
individual
individuals
industrial
industry
inevitable
inexpensive
infer
infield
infinite
infinitely
inflate
inflated
info
information
informationgolden
ingnoring
inherited
initial
initially
initials
injure
injured
injuries
injury
inner
inning
innings
inns
ino
inopportune
ins
insert
insight
insightful
insists
inspirational
instances
instead
instill
institutions
insult
insulting
insults
int
integral
intelligence
intelligent
intend
intention
intentional
intercollegiate
interest
interested
interesting
interfere
interjects
internet
interpreted
interview
interviewed
interviewer
interviews
intimate
intimidation
into
intrinsically
introduced
invalid
invariably
investigators
investment
invitation
involved
iopposing
iowa
iq
ironic
irrelevant
is
island
islander
islanders
isle
isles
ismail
isn't
isolate
issue
issues
it
it'd
it's
italy
item
its
itself
iup
iv
ivan
ix
j's
jack
jacket
jackson
jacobs
jagr
jagr's
jail
jake
james
jan
jane's
janney
january
japan
jaromir
jarvis
jason
javier
jay
jays
jayson
jazzsoft
jd
jean
jeez
jeff
jeffery
jeffrey
jerk
jerks
jerky
jermey
jerry
jersey
jerseys
jesus
jet's
jets
jewish
jewlery
jfz
jg
jiann
jim
jimmy
jinx
jm
job
jobs
jody
joe
joe's
joerg
joeydid
johansson
john
john's
johnny
johnrunski
johnson
johnsonuniv
joints
joke
jokers
joking
jon
jonas
jones
jose
joseph
jour
jr
jt
juan
juanderful
judge
judgement
juggled
juggling
juha
jukurit
july
jump
jumping
jumps
june
just
justice
k1a
kaiser
kamensky's
kanada
kane's
kansas
kari
kariya
karpov
karros
kdka
keane
keenan
keep
keeping
keeps
keithmullinso
kelly
kemppainen
ken
kennedy
keon
kept
kerry
kevin
kevinstamber
kevorkian
key
keynes
kick
kicked
kickers
kicking
kid
kiddies
kidding
kids
kill
killed
killer
killers
killerwhales
kimball
kimo
kind
kinds
kinerisms
king
kingman
kings
kingston
kippur
kirby
kirk
kisio
kiss
kl
klasko
klink
knee
knees
knepper
knew
knicks
knights
know
knowing
knowledgable
knowledge
knowledgeable
known
knows
knuckelball
knuckling
kocur
kocus
koivu
komo
konstantinov
koosman
korean
koufax
kovalev
kozlov
kramer
kravchuk
krenn
krueger
kurt
kuryia
kyle
l's
la
label
labeled
labeling
labels
labinger
laboratory
lachance
lack
lacks
lady
lafontaine
lak
lakers
lame
lamp
lance
land
langauge
langevin
language
lankford
lansing
largely
larger
larkin
larsson
lasorda
last
lat
late
lately
later
latest
latter
lau
laugh
laurie
lavalliere
law
lawn
lawyers
lazaroottawa
lazy
leach
lead
leader
leading
leadoff
leads
leaf
leafs
league
league's
leagueamerican
leaguen
leaguer
leagues
lean
learning
lease
least
leave
leaving
lebeau
leblanc
leclair
led
lee
lees
leetch
lefferts
left
lefties
lefty
leg
legal
legge
legitimate
legs
legzryx
lemieux
lemieux's
lemon
len
lenging
lengths
lenient
lenny
leonard
les
less
lesser
lesson
lessons
let
let's
lets
letters
letting
leuenberger
level
levels
lewey's
lewis
lf
liberal
liberally
lidstrom
life
lifted
light
lighters
lightning
lights
like
liked
likely
likened
likes
likewise
limit
lind
lindros
line
linear
lines
linesmen
lineup
lineups
lippe
lips
lisa
lisa's
list
listed
listen
listening
lists
literally
litle
little
littlest
live
lived
liver
lives
living
loaded
lob
local
locals
lock
locker
logic
logical
logistician
logo
loke
london
lone
long
lonnie
look
looked
looking
looks
loops
loos
lopez
lor
lord
lori
los
lose
loser
losers
losing
loss
losses
lost
lot
lots
louis
louisiana
lousiest
lousy
love
loves
lowe
lowenstein
lower
lowest
loyal
loyalties
loyalty
luber
luc
luck
lucky
ludicrous
luggers
luigi
luis
lupica
lupica's
lurking
lustig
lynette
lyrics
maawalis
macdonald
machine
maclean
macoun
macro
mad
maddax
maddux
made
magadan
magic
magicians
magowan
mahi
mail
mailing
main
maintain
major
majority
majors
mak
make
makes
making
malarchuck
maldonado
male
maligned
malingerer
malingering
man
man's
manage
managed
management
manager
managerial
managing
mandate
mandelbaum
mandell
mann
manner
manny
manon
manson
mantle
manual
manuele
manwaring
many
manyhere
map
maple
marauders
marc
marcaccio
march
marcs
margin
marginal
mariners
mario
mario's
mark
marked
market
marketing
markets
marks
marline
marlines
marlins
marshall
martin
martin's
martinez's
marven
mary
masculinity
mask
massively
match
matching
matd
materially
mathematics
mathof
matt
matter
matters
matthewthompson
mattingly
maulers
mauro
max
maximum
may
maybe
maynard
mays
mccovey
mcdonald
mcdonnel
mcelroy
mcgee
mcgill
mcgreer
mcguire
mclean
mcnall
mcrae
mcwho
me
mean
meaning
meaningful
meaningless
means
meanwhile
measure
measures
meat
media
mediot
meekly
meet
mel
melido
melrose
member
members
memorable
memories
men
men's
mentality
mention
mentioned
mentioning
mentionned
merchandise
merchandising
merely
message
messiah
messier
methods
metro
mets
meyers
miami
michael
michaels
michigan
mid
middle
middlemen
midnight
midwest
might
mighty
mike
milacki
milbury
mildly
miles
militello
mill
miller
million
millions
millitello
milt
milton
milwaukee
min
mincing
mind
mindscheme
mine
ming
mini
minimal
miniseries
minn
minnesota
minor
minors
mins
minus
minute
minutes
miracle
miracles
mirrored
misconduct
misconducts
misplayed
miss
missanelli
missed
missing
mission
misstatements
mistake
mistakes
mitchell
mix
mize
mlb
mo
modanominnesota
models
moe
mogilny
molitor
momemtum
moment
momesso
mon
moncton
monday
money
monica
monkey
montana
montandon
month
montreal
montreal1new
montys
moog
mopar
more
morgan
morgani
morganti
morning
morning's
mornings
morons
morris
most
mostly
mota
mother
motioned
motor
mound
mount
mountain
mounted
mouth
mouths
move
moved
moves
movie
movies
moving
mowing
mr
mraz
mrp
msg
mt
mtl
much
muelins
mulberry
mules
mullen
muller
mullerwalker
mundo
munich
murder
murky
murphy
murphy's
murray
muscle
music
mussina
must
my
myers
myllyp
myllypuro
myself
mystique
nacho
nagging
nail
naive
naked
name
named
namely
names
naming
nanaimo
napolitano
naslund
nasty
nation
national
nationwide
native
navy
nba
ncaa
near
nearly
neat
necessarily
necessary
necessasarily
neck
nedved
need
needed
needs
negative
negatively
negatives
neiporent
neither
nemchinov
nepotism
nerves
nervous
net
nets
netters
network
networks
neural
neutral
never
new
newfoundland
news
newsgroup
newspaper
newspapers
next
nfl
nhl
nhl's
nice
nicely
nicholls
nichols
nick
nickel
nielsen
nieporent
nieporents
nieuwendyk
nieves
nigger
night
night's
nights
niguma
nine
nineties
ninth
nit
nite
nixon
nj
njd
nl
nlcs
no
nobel
nobody
nod
nokes
nolan
nominate
non
none
nonetheless
nonsense
noon
nooooooooooooooooo
nope
nor
nordique
nordiques
nords
normally
norris
north
northern
northlands
norway
norwegian
nose
not
note
noted
notesgroup
nothing
notice
noticed
notre
november
novice
now
nowadays
nowhere
nowwegian
nti
nuisance
numb
number
numbers
nutri
nuts
ny
nyi
nylander
nyr
nystrom
o'neil
o'neill
o's
oakland
oakville
oates
obfbl
object
objected
objectionable
objective
objectives
obligation
obp
obscenities
observer
observers
obvious
obviously
occasional
occasions
occupation
occupied
occur
occured
occurred
oceanweavers
october
odd
oddly
odgers
of
off
offen
offend
offense
offensive
offer
offered
offering
offerman
offers
office
officially
officiating
offside
often
oh
ohio
ohl
oiler
oiler's
oilers
ojala
ok
okay
ol
olczyk
olczyknew
old
older
olerud
olson
omaha
on
once
one
one's
ones
only
onlyseconds
onsforget
ontario
oonly
oops
open
opened
opener
opening
opera
operate
opinion
opinions
opportunites
opportunities
opportunity
opposing
opposite
opposition
oquendo's
or
order
ordered
orders
organization
oriental
original
originally
originated
oriole
orioles
orlando
orleans
ot
other
others
otherwise
otis
ott
ottawa
otto
ought
oulu
ounce
our
out
outclassed
outcome
outfield
outfielder
outfielders
outlaws
outlet
outlined
outlook
outplayed
outplaying
outs
outscore
outset
outside
outspoken
outstretched
outta
over
overage
overall
overburdened
overcome
overconfident
overnight
overrated
overriding
overtime
overturn
owen
own
owner
owners
ownman's
oz
ozzie
pablo
pace
pacific
packers
padded
padres
page
paid
paige
pain
painful
painfully
paint
painted
pair
pallone
palm
palmer
palyer
pam
pan
pandas
paper
papers
parades
paragraph
paramount
paranjape
pardon
parents
park
parking
parslow
part
participate
participated
participating
particular
particularly
partly
party
pasi
pass
passing
past
pasture
pat
patch
pathetic
patience
patrick
patriots
paul
paulson
pavel
pavoni
pavoni's
pay
paying
pc
pct
pd
peace
pederson
pen
penalties
penalty
pendleton
penguin
penguine
penguins
pennant
pennent
pennsylvania
penquins
pens
people
people's
peoples
pepper
per
percentage
perennial
perez
perfect
perfectly
performance
performancer
performers
performs
perhaps
peril
period
periods
permenantly
permitting
person
personal
personality
personally
personnel
perspective
perspectives
peter
pettis
pgh
pgh's
ph
phantom
phelps
phenomenon
phi
phil
philadelphia
philadelphia3detroit4
philldelphia
philli
phillidelphia
phillie
phillies
phillips
philly
phone
phrase
phyllis
physical
piazza
pick
picking
picks
picture
piece
pigs
pilon
pilon's
pinch
pine
pinhead
pinson
pipeline
pirates
pissed
pisses
pit
pitch
pitched
pitcher
pitchers
pitches
pitching
pitiful
pitt
pittsburg
pittsburgh
pittsburgh's
pittsurgh
pivonka
place
plain
plan
planes
planning
plans
planteuniv
plate
plavsic
play
played
player
player's
players
players'
playing
playoff
playoffs
plays
pleasant
pleasantly
please
pleasemail
pleistocene
plenty
plexiglassso
ploys
plugger
pluggers
plunked
plus
pm
pock
pocklington
podein
podeinedmonton
point
pointed
points
poisoning
police
policy
polish
political
politicians
politics
poly
pomona
pooland
pools
poor
poorly
popovich
por
portray
portrayed
pose
position
posn
posnteamptsremlast
possibility
possible
possibly
post
posted
postema
poster
posting
postings
postition
posts
potential
potentially
poteux
pother
potvin
potvin's
poulin
pound
power
powerful
powerhouses
powerplay
pp
pplease
ppv
practice
practices
practise
praise
pray
pre
precedent
precisely
predict
predicted
predicting
prediction
predictions
preface
prefer
preference
preferences
premise
prepared
preparing
presence
present
presently
president
press
pressure
prestige
presume
presumption
pretty
prevent
previous
prices
primadonna
primarily
primary
prime
primeau
primer
prints
prior
priority
pritchard
private
privatemail
privileged
prize
pro
probably
probert
problem
problems
proceeded
process
processed
produce
productive
productivity
professional
professionals
prognosis
programs
prohibits
projected
projection
promise
promising
proof
propects
proper
properly
prospect
prospects
prospectwhich
protect
protecting
protest
prototypes
proud
prove
proven
proves
provide
provided
providence
providence's
providing
provincial
psycho
ptoronto
pts
pub
public
publicity
publicly
puck
puckett
puggy
pulford
pull
pulling
pullman
punch
punched
punching
punk
purdue
purely
purpose
purposely
put
putouts
puts
putting
pwe
pwho
qtr
qualify
quality
quantities
quarter
quarterback
quarterfinals
quayle
que
quebec
quebecois
ques
question
questionable
questions
quibble
quick
quicker
quickest
quickly
quiet
quinn
quite
quote
quoted
quotes
quoting
race
racially
racicot
racine
racismcobb
racist
racking
radically
radio
raiders
rainiers
raining
rainy
raise
raisins
rally
ralph
ramble
random
randy
ranford
range
ranger
ranger's
rangers
rank
ranked
ranking
rarely
rate
rather
rating
rauch
raw
ray
raymond
rbi
rbi's
rbis
re
reached
reaching
react
read
reading
ready
real
realignment
reality
realization
realize
realizes
really
rear
reardon
reason
reasonable
reasoning
reasons
reassemble
rebels
rebound
rebuilding
rec
recall
recalls
recchi
recci
receive
received
receiving
recent
recently
reclaimed
recognition
recommended
reconsider
record
recordings
records
recovered
recruiting
red
redbirds
rednecks
reds
reduced
redus
redwings
reed
reese
reevaluate
ref
refer
reference
refers
refs
refuse
refused
regarding
regardless
regards
regather
reggie
regular
regularly
regulation
reichel
reigns
reinstate
rejected
reksa
related
relation
relatively
release
released
relegated
reliable
relief
relieved
reliever
relievers
relieving
religion
religious
reluctant
remainder
remained
remaining
remark
remarkably
remarked
remarks
remember
remembered
remembering
remind
reminded
remo
remote
remove
renberg
renders
reneb
renegotiate
rented
rep
repeatedly
replace
replacement
replays
replied
replies
reply
repo
report
reported
reporter
reporters
reporting
represent
representing
represents
republic
request
required
requiring
rescinded
research
resemblance
resent
residing
resist
resisted
resources
respect
respond
response
responses
responsibility
responsible
rest
restart
rested
restore
result
resulted
results
resumes
ret
retarded
retention
retire
retired
return
returned
returning
rev's
revenge
review
reviews
rf
rh
rheaume
rhodes
rib
rich
richard
richardrauser
richie
richmond
richter
rick
rickey
ricks
rid
ridiculous
riendeau
right
rights
righty
riihij
riles
ring
rings
rinks
ripening
rivera
rivers
rjackson
rm
road
roar'in
roast
rob
robarts
robbed
robby
roberthite
roberto
robin
robinson
robitaille
rochester
rock'em
rockeasy
rocked
rocket
rockets
rockies
rockmetalalternativebluesrap
rod
rodriguez
roenick
rog
roger
roger's
rogers
rolaids
roland
role
roller
rolling
roman
ron
roney
rookie
rookies
room
rose
ross
roster
rotate
rotating
rotation
rotisserie
rough
roughly
round
rounded
roussel
route
row
roy
roy's
royals
rsb
rstimets
rubbish
rudy
rule
rules
ruling
rumour
rumoured
run
runner
runners
running
runs
rush
rushing
russ
russell
russia
russian
russians
russo
ruth
ruuttu
rvi
ryan
sabo
sabo's
sabres
sac
saccoboston
sad
safe
said
sakic
sakic's
saku
salami
salary
sales
salmi
sam
same
samuel
san
sandberg
sanders
sanderson
sandra
sandro
sandy
sank
sankar
santiago
sare
sat
satellite
sather
saturday's
save
saves
saving
savoring
saw
sax
say
saying
says
sb
scale
scandinavians
scared
scarf
scary
scenario
scenarios
scenes
schedule
scheme
schlafly
schmautz
schmidt's
schmoe
schneider
school
schools
schott
schwartz
scialdone
scoop
scooter
score
scored
scorer
scorera
scorers
scores
scoring
scott
scotty
scrambles
scratch
screed
screen
screened
screw
screwed
scrooges
scuk
scully
sd
sealed
sean
season
season's
seasons
seats
seattle
seaver
sec
second
secondary
secondly
seconds
secret
section
see
seeing
seem
seemed
seemingly
seems
seen
sees
segura
seinfeld
selanne
selanne's
selannes
select
selected
selection
selective
self
selfishness
selke
sell
selling
sellouts
sells
semi
semi's
sen
senators
send
sending
sens
sense
sent
sentiments
separate
sepinwall
seppo
series
serious
seriously
serves
set
setting
settle
settled
setup
seven
seventh
several
severely
sex
sexual
sf
sfb
shabby
shall
shame
shamsky
shanahan
shape
share
shariff
shark's
sharks
shawn
she
she'd
she's
shea
shear
sheesh
shelf
shell
shepard
sheppard
sherri
sherry
shiff
shift
shigella
shion
ship
shit
shocked
shoe
shoes
shoot
shooters
shore
short
shorthanded
shortstop
shortstops
shot
shots
should
shoulda
shoulder
shouldn't
show
showalter
showed
showing
shown
shows
shrink
shut
shutout
shutouts
sick
sickening
sid
side
sides
sierra
sig
sign
signature
signatures
signed
significantly
signs
silent
silicon
sillinger
silly
silvestri
similar
similarly
similiar
simmons
simple
simplify
simplistic
simply
since
sincerest
sinden's
singer
singing
single
singled
singles
sit
site
sitting
situation
situational
situations
sively
six
sixers
sixteen
sixth
size
sj
skate
skated
skater
skates
skating
skeds
skeptical
skill
skills
skin
skipjacks
skriko
skrudland
skull
slack
slammed
slap
slash
slashed
slashing
sleeper
sleepers
slg
sliding
slinking
slip
sloppiness
slot
sloth
slow
slowly
sludge
sluggo's
slumping
smacked
small
smart
smashes
smith
smithw
smoke
smoltz
smythe
sneddon
snip
snorris
snow
snowing
snyder
so
sock'ems
soderstrom
soderstron
sold
soldiers
solid
solo
solution
somail
some
somebody
somehow
someone
someones
someplace
something
sometimes
somewhat
somewhere
son
soon
sooner
soooo
sophomore
sorry
sort
sosa
sound
sounds
source
south
southern
southpaws
southwestern
sox
sp
space
spain
span
spark
sparky
sparky's
speak
speaking
speaks
special
specific
specifically
spectacular
sped
speech
speed
spelled
spelling
spend
spending
spent
spew
spewing
spicer
spike
spirit
split
splits
spoiled
sport
sports
sportscats
sportscenter
sportsdesk
sportstalk
spot
spouse
spouses
spread
spring
springfield
squeeze
squished
ss
st
stability
stacey
stadium
staff
staffs
staightened
stainless
stand
standard
standards
standings
stands
stanias
stank
stankiewicz
stankowitz
stanky
stanley
stanley's
star
stark
stars
start
started
starter
starters
starting
starts
state
stated
statements
states
stathead
static
stating
station
stations
statistic
statistical
statistics
stats
status
stay
stayed
steady
steal
stealing
steals
steel
steigy
stein
steinbakken
steinbrenner
step
stephen
stepped
steps
sterling
stern
steve
steveliu
stevens
steves
stewart
stick
stickers
sticking
sticks
stieb
stiff
stiffness
still
stl
stole
stolen
stomach
stood
stop
stopped
story
stragegy
straight
strange
stranger
strategic
strategy
strawberry
strawman
strayed
streak
street
stress
stretch
stretcher
stretching
strictly
strike
strikeout
strikes
striking
strings
stroke
stroked
strong
stronger
strongest
struggle
struggling
stubborn
stud
students
studied
studio
study
stuff
stunk
stupid
style
styles
su
subject
subjective
subscribe
subscription
subtropics
success
successful
successfully
succinctly
such
suck
sucked
sucks
sudden
suddenly
suds
suffering
sufficient
suggest
suggestions
suggests
sum
summer
sun
sunday
sunday's
sundin
superb
superior
superstar
superstars
superstition
support
supporter
supporteres
supporting
supportive
suppose
supposed
supposedly
supreme
suprised
sure
surely
surf
surfing
surgery
surpass
surprise
surprised
surprises
surprising
surrounded
surrounding
surrounds
survey
survive
survived
susan
suspect
suspended
suspending
suspension
sutcliffe
sutter
sutter's
sven
swap
swear
sweden
swedes
swedish
swedishand
sweep
sweepers
sweeping
sweepstakes
sweet
swept
swing
swinging
swings
swiped
swiss
switching
switzerland
symbol
syndicate
system
systems
table
tac
tacoma
tactics
tagged
tags
tail
tailspins
take
taken
takes
taking
talent
talents
talk
talkin
talking
tampa
tampere
tandem
tanked
taped
tapio
tartabull
taste
taught
taunt
taunts
taylor
tb
tbs
teach
team
team's
teammates
teams
tear
technical
technically
technology
ted
tee
teem
teemu
telephone
televise
tell
telling
tells
ten
tend
tendency
tends
tentative
tequila
teresa
term
terminated
terms
terrible
terrific
terry
terry's
test
tettleton
texas
text
tgo
th
than
thancobb
thank
thanks
thankyouthankyouthankyou
thantime3
thanx
thar's
that
that'll
that's
the
their
thekey
them
theme
themselves
then
theory
there
there's
therefore
theres
thes
these
they
they'd
they'll
they're
they've
thin
thing
things
think
thinking
thinks
third
thirty
this
thomas
thompson
those
though
thought
thoughtful
thoughts
thousand
thread
threaten
threats
three
threepeat
threw
through
throughout
througout
throw
throwing
thrown
throws
thumped
thundering
thursday
thus
ticket
tickets
ticudtee
tie
tied
tiedbaltimore
tiedfredericton
tiedspringfield
tiger
tigers
tijuana
tikkanen
tikkannen
till
time
timeand
timed
timeout
timer
times
timetable
timing
timo
tiny
tioned
tip
tips
tired
title
tix
tlpj
tlpj's
tnt
to
tocchet
today
today's
together
told
tom
tommy
tommy's
tomorrow
ton
tonight
tonite
tons
tony
too
took
tools
top
topic
tor
torborg
toronto
toronto's
torre
tory
toss
tossed
total
totally
totals
tough
tougher
tournament
tourney
towards
towel
tp
trace
trade
traded
trading
traditional
traditionally
traffic
trailed
training
transaction
transcend
transfer
transplant
trash
travel
traveled
trayed
treats
trefilov
tremendous
trend
trends
trevor's
trhink
trial
triangle
tribe
trick
trickled
tried
tries
trim
triple6025
triulzi
triumph
trophies
trophy
trottier
trouble
troy
true
truly
trust
try
trying
tsn
tues
tuesday
tuesdays
tugnutt
tugnutt's
tumbled
tune
tuned
tunney's
turcotte
turgeon
turn
turnaround
turned
turner
turning
tv
twice
twins
two
tying
type
types
ugh
uh
uhhhh
ulfie's
ump
umpire
umpire's
umpires
umps
unattacked
unb
unbiased
uncomplicated
unconcerned
undefeated
under
underachieved
underdog
underdogs
underrated
understand
understanding
understood
underwriters
undoubtedly
unfalsifiable
unfortunate
unfortunately
unfortunatly
uniform
uniforms
uninformed
unintentional
univ
universe
universities
university
unless
unlike
unnecessary
unprofessional
unreasonable
unspectacular
unsubstantiated
unsure
untapped
until
unveiled
unwilling
up
upheld
upon
ups
upside
us
usa
use
used
useless
usenet
user
uses
using
usually
usui
utica
utter
utterly
uuuggghhhh
vacation
valentine
valeri
valid
value
valued
van
vanbiesbrouck
vanc
vancouver
variable
variety
varsho
varsity
vary
vast
vehemence
velarde
verge
vergolini
vernon
version
versions
very
vesterman
veterans
vezina
via
vice
vicious
victims
victory
video
view
villain
vin
vince
vincent
violating
violence
virtual
vital
vitaminshots
vizcaino
vizquel
vlad
vladimir
vocabulary
vocal
volleyball
volume
volunteer
vote
voted
voters
votes
voting
vrabec
vs
wacky
wade
waeger
wagons
wait
waited
waiting
waking
waldo
walk
walked
walker
walking
walks
walkure
wallach
wallet
wallow
walter
wamsley
wankers
want
wanted
wants
warm
warren
warriors
wart
warthawks
was
wasfor
wash
washed
washington
wasn't
waste
wasting
watch
watched
watching
water
waterloo
way
wayne
ways
wc
wcfields
wduq's
we
we'll
we're
we've
weak
weaker
weapons
wear
wearing
weasels
weather
weathered
weber
webster
wednesday
week
weekend
weekends
weekly
weeknight
weeks
weenies
weight
weightedmonton
weights
weiss
welcome
welcomed
well
wells
went
were
weren't
wesley
wessels
west
western
wetteland
wfan
wgn
whacked
whalers
what
what's
whatever
whats
whatta
when
whenever
where
where's
whether
which
whichever
while
whiner
whining
whispers
whitaker
white
whiters
whites
whitman
whittier
who
who's
whoever
whole
whom
whose
why
wickman
wieght
wieman
wife
wild
wilkins
wilkinson
will
williams
willie
willing
wilpon
wilson
win
winding
winfield
wing
wingers
wings
winner
winning
winningham
winninham
winnipeg
winnipeg's
wins
winter
wip
wiped
wirtz
wise
wish
wishes
wit
with
within
without
withr
wizard
wni
wolves
woman
women
women's
won
won't
wonder
wonderful
wondering
woodwork
woofers
woops
wor
word
words
wore
work
workday
worked
working
works
workshop
world
worldwide
worried
worry
worse
worst
worth
worthless
would
wouldn't
wound
wow
wrap
wrapped
wreaks
wrecking
wrench
wrist
wristbands
write
writers
writes
writing
written
wrong
wrote
ws
wynn
wysp
xxx
y'know
ya
yadalleesc
yahooooooooooooooooooooo
yan
yang
yankee
yankees
yanks
yards
yastrzemski
yatrou
yawney
ye
yeah
year
year's
yearg
years
yell
yells
yes
yesterday
yesterday's
yet
yom
york
york3chicago
york9
you
you'd
you'll
you're
you've
young
younger
yount
your
yours
yourself
yserbeart
yuck
yzerman
zachmans
zealand
zeile
zeile's
zelepukin
zero
zezel
zipper
zippety
zombo
zone
zubov
